#задача№1

# str1 = input("Введите первую строку: ")
# str2 = input("Введите вторую строку: ")
# s = set(str1) - set(str2)
# print(s)
# for i in s:
#     print(i, end=" ")

#Задача №2

# letter = 'аоуэыяёюеиaeiouy'
# str1 = input("Введите строку: ")
# count = 0
#
# for i in str1:
#     for b in letter:
#         if b in i:
#             count += 1
#
# print("Количество гласных букв: ", count)

#Задача№3

# str1 = input("Введите первую строку: ")
# str2 = input("Введите вторую строку: ")
# s = set(str1) | set(str2)
# print(s)
# for i in s:
#     print(i, end=" ")

#Задача№4

# str1 = input("Введите первую строку: ")
# str2 = input("Введите вторую строку: ")
# s = set(str1) ^ set(str2)
# print(s)
# for i in s:
#     print(i, end=" ")
